#####
# TERMINAL
#####

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Cross-shell prompt for astronauts
brew "starship"
# Simple terminal UI for git commands
tap "jesseduffield/lazygit"
brew "lazygit"
# Lazier way to manage everything docker
brew "lazydocker"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fast, highly customisable system info script
brew "neofetch"
# Run arbitrary commands when files change 
brew "entr"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Modern, maintained replacement for ls
brew "eza"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Terminal multiplexer
brew "tmux"
# An i3-like tiling window manager for macOS
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"
# Hack Nerd Font (Hack)
cask "font-hack-nerd-font"
# JetBrainsMono Nerd Font families (JetBrains Mono)
cask "font-jetbrains-mono-nerd-font"
# Internet file retriever
brew "wget"
# Syntax-highlighting pager for git and diff output
brew "git-delta"


#####
# DEVELOPMENT
#####

# Distributed revision control system
brew "git"
# Also known as: gnupg@2.4, gpg, gpg2
brew "gnupg"
# Defines a standard way of committing rules and communicating it
brew "commitizen"

# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# App to build and share containerised applications and microservices
cask "docker-desktop"

# Embeddable SQL OLAP Database Management System
brew "duckdb"

# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"

# Post-modern modal text editor
brew "helix"
# Language Server for Bash
brew "bash-language-server"
# Markdown LSP
brew "markdown-oxide"

#####
# RUST
#####
# Cargo Lambda is a Cargo subcommand to help you work with AWS Lambda.
tap "cargo-lambda/cargo-lambda"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
# TOML toolkit written in Rust
brew "taplo"

#####
# PYTHON
#####

# Fast, scalable, user-friendly build system for codebases of all sizes
tap "pantsbuild/tap"
cask "pants"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Extremely fast Python linter, written in Rust
brew "ruff"

#####
# NODE
#####

# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier" 

#####
# DEVOPS
#####

# Terraform
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
# Localstack cli packaged using pyinstaller
tap "localstack/tap"
brew "localstack/tap/localstack-cli"
# Tool for cloud security assessments, audits, incident response, and more
brew "prowler"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform Language Server
brew "terraform-ls"

